In [1]:
# Dataframes is similar to a dictionary whose values are list but with more functionality
people = {
    "Name": ["Gautam", "Kumaresan", "Devi"],
    "Age": [26, 61, 53],
    "Gender": ["Male", "Male", "Female"]
}
people

{'Name': ['Gautam', 'Kumaresan', 'Devi'],
 'Age': [26, 61, 53],
 'Gender': ['Male', 'Male', 'Female']}

In [2]:
import pandas as pd
people1 = {
    "Name": ["Gautam", "Kumaresan", "Devi"],
    "Age": [26, 61, 53],
    "Gender": ["Male", "Male", "Female"]
}
df = pd.DataFrame(people1)
df

        Name  Age  Gender
0     Gautam   26    Male
1  Kumaresan   61    Male
2       Devi   53  Female

In [13]:
# dataframes will rows and columns 
# series will have values from single column
# both will have indexes
people['Age']

[26, 61, 53]

In [14]:
df['Age']

0    26
1    61
2    53
Name: Age, dtype: int64

In [15]:
print(type(df['Age']))

<class 'pandas.core.series.Series'>

In [16]:
# if you want to get multiple columns it has to be a list of lists
df[['Age', 'Name']]

   Age       Name
0   26     Gautam
1   61  Kumaresan
2   53       Devi

In [17]:
# get all columns
df.columns

Index(['Name', 'Age', 'Gender'], dtype='object')

In [18]:
# iloc get columns and rows using integer index
# get first row
df.iloc[0]

Name      Gautam
Age           26
Gender      Male
Name: 0, dtype: object

In [19]:
# get mulitple rows
df.iloc[[0, 1]]

        Name  Age Gender
0     Gautam   26   Male
1  Kumaresan   61   Male

In [20]:
# get mulitple rows with columns
df.iloc[ [0, 1] , [0, 1]]

        Name  Age
0     Gautam   26
1  Kumaresan   61

In [22]:
# loc can use names for indexes rather than numbers
# Labels can be used for rows as well and that example is not here
df.loc[ [1, 2] , ["Name", "Age"]]

        Name  Age
1  Kumaresan   61
2       Devi   53